Revit 2027 API
CompoundStructure.IsValidSampleHeight Method
 Is the specified height a valid sample height for this compound structure?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSampleHeight(
	double height
)
Public Function IsValidSampleHeight (
	height As Double
) As Boolean
public:
bool IsValidSampleHeight(
	double height
)
member IsValidSampleHeight :
        height : float -> bool
Parameters
height Double
Return Value
Boolean
Remarks
 The sample height cannot be less than the value of MinimumSampleHeight.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace